# GetSuperscriptStatus Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FormattedText..::..GetSuperscriptStatus Method
FormattedText Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetSuperscriptStatus()()()() | Returns whether All, None or a Mixed of characters in the entire text are superscripted. |
| GetSuperscriptStatus(TextRange) | Returns whether All, None or a Mixed set of characters in a given text range are superscripted. |

# See Also
FormattedText Class
FormattedText Members
Autodesk.Revit.DB Namespace